void main() {
  String text = '''  ورود
چهارشنبه ۵ مرداد, ۱۴۰۱درباره ماهمکاری با فارنتتماس با مارپرتاژ در فارنت
فارنت | Farnet

فارنتموبایلکامپیوتراینترنتبررسیدنیای بازیامنیتفارنت پلاسراهنمای خرید
خانهآموزشآموزش جامع  اینستاگرام؛ از سیر تا پیاز!

آموزش
آموزش جامع اینستاگرام؛ از سیر تا پیاز!
حتی اگر تاکنون از سرویس مشهور اشتراک عکس اینستاگرام استفاده نکرده‌اید حتماً نام آن را شنیده‌اید. در این مطلب قصد داریم برای آشنایی بیشتر شما با این سرویس آموزشی جامع را در اختیارتان بگذاریم.

از علی ارغوان منتشر شده در ۱۳:۲۷ سه شنبه, ۱۶ مهر , ۱۳۹۲
 ۲۴۶۸۰
 به اشتراک‌گذاریFacebookTwitterپست الکترونیک
مطلب آموزش اینستاگرام در ۱۵ خردادماه ۱۳۹۶ با اضافه کردن لینک کامل ثبت‌نام به‌روزرسانی شد – سؤالات رایج بیشتر به همراه پاسخ اضافه شد. لطفاً پیش از پرسیدن سؤال در بخش نظرات مطلب آموزش اینستاگرام را به طور کامل مطالعه کنید.

در حال حاضر بیشتر کاربران ترجیح می‌دهند برای اشتراک تصاویر و بعضی اوقات ویدئوهای کوتاه خودشان به جای شبکه‌های اجتماعی دیگری مانند فیس‌بوک از اینستاگرام استفاده کنند؛ چرا که مخاطبان بیشتری تصاویرشان را می‌بینند و همچنین افکت‌های جذاب آن کار را برای کاربران آسان کرده‌است. در این مطلب آموزش اینستاگرام از سیر تا پیاز اینستاگرام را برای کاربران تازه‌وارد به شما آموزش خواهیم داد.

در همین خصوص بخوانید..
آموزش ورود دو مرحله‌ای اینستاگرام | به همراه روش غیرفعال…

۹ خرداد, ۱۴۰۰
آموزش مخفی کردن تعداد لایک در اینستاگرام و فیس‌بوک

۶ خرداد, ۱۴۰۰
آموزش کامل IGTV اینستاگرام؛ همه چیزهایی که باید بدانید

۳۱ خرداد, ۱۳۹۷
آموزش دانلود تمام عکس‌ها و ویدئوهای اینستاگرام با ابزار جدید…

۵ اردیبهشت, ۱۳۹۷
آموزش استفاده و ارسال تصاویر در اینستاگرام در کامپیوتر و با…

۱۳ اسفند, ۱۳۹۶
آموزش کامل بلاک و آنبلاک در اینستاگرام؛ برای تازه‌کارها

۶ تیر, ۱۳۹۶
آموزش کامل ثبت‌نام و ساخت اکانت در اینستاگرام؛ برای…

۱۳ خرداد, ۱۳۹۶
آموزش قراردادن آلبوم تصاویر و ویدئوها در اینستاگرام

۵ اسفند, ۱۳۹۵
آموزش اینستاگرام
برای استفاده از اینستاگرام باید این برنامه را برای روی دستگاه هوشمند خود نصب کنید و طبیعتا به یک گوشی یا تبلت اندرویدی و یا آیفون، آیپاد تاچ و یا آیپد نیاز دارید. آخرین نسخه اپلیکیشن اینستاگرام را برای اندروید می‌توانید از بازار یا گوگل پلی و برای iOS از اپ‌استور به رایگان دانلود کنید.

 

حالا برای استفاده از اینستاگرام باید در این سرویس عضو شوید. ثبت نام و ساخت اکانت در اینستاگرام کار پیچیده‌ای نیست اما باید دقت لازم را در آن به خرج دهید. برای عضویت و ثبت نام در اینستاگرام می‌توانید از طریق بخش Sign up در پائین صفحه اول برنامه مراحل را دنبال کنید اما توصیه می‌کنیم حتما این کار را از طریق آموزش کامل ثبت نام و ساخت اکانت اینستاگرام در این مطلب از فارنت انجام دهید.

آموزش کامل ثبت نام و ساخت اکانت اینستاگرام
پس از عضویت می‌توانید عکسی به عنوان تصویر پروفایلتان انتخاب کنید و یک بیوگرافی کوتاه تا ۱۵۰ کلمه در مورد خودتان به همراه آدرس وب‌سایت بنویسید.

پروفایل‌های اینستاگرام به صورت پیش‌فرض در حالت Public یا عمومی قرار دارند؛ به این ترتیب هر کسی با داشتن نام کاربری اینستاگرام شما قادر خواهد بود تصاویرتان را ببیند. اما اگر نمی‌خواهید به همه این اجازه را بدهید می‌توانید با ورود به دکمه اول از سمت راست و انتخاب دکمه سه نقطه و سپس تیک زدن Private Account تصاویرتان را خصوصی کنید. به این ترتیب تنها افرادی که با اجازه شما اکانت‌تان را دنبال می‌کنند (Followerها) می‌توانند تصاویرتان را ببینند؛ البته این تنظیمات تأثیری روی دنبال‌کنندگان فعلی شما ندارد.

آموزش اینستاگرام / به اشتراک‌گذاری تصاویر و ویدئوها
آموزش اینستاگرام
در نوار ابزار پایین صفحه دکمه وسط مربوط به شروع عکاسی و یا فیلم‌برداری برای به اشتراک‌گذاری است. با لمس آن اپلیکیش دوربین اینستاگرام اجرا شده و می‌توانید عکس بگیرید. همچنین با فشردن دکمه سمت چپ شاتر (شکل ۹ نقطه) می‌توانید تصاویری را که قبلاً گرفته‌اید از گالری وارد کنید و همچنین از دکمه‌های بالای آن برای سوییچ بین دوربین‌های جلو و عقب، فعال‌کردن فلش و خطوط راهنما استفاده کنید.

اینستاگرام همچنین اخیراً قابلیت به اشتراک گذاری فیلم‌ها را نیز فراهم کرده و با فشردن دکمه دوربین فیلم‌برداری تا ۱۵ ثانیه به صورت مداوم فیلم‌برداری کنید و یا چندین قطعه را به هم بچسبانید. ویدئوها را هم می‌توانید مانند تصاویر با افکت‌های خاصی زیباتر کنید.

آموزش اینستاگرام / ویرایش تصاویر 
پس از گرفتن عکس مورد نظر و هدایت به صفحه ویرایش امکانات خوبی را در اختیار خواهید داشت. درست زیر عکس سه دکمه چوبدستی شعبده‌بازی، آچار و یک خورشید و یک مشاهده می‌کنید.

Instagram-Step-2
چوب‌دستی افکت‌های مختلفی را بر روی عکس اعمال می‌کند که در آخرین نسخه اینستاگرام، پنج افکت جدید نیز اضافه شده‌است. وقتی افکت مورد نظر را انتخاب کردید با لمس دوباره آیکن مربوط به آن می‌توانید شدت افکت را تنظیم کرده و قاب مربوط به آن را اضافه یا حذف کنید .

در آخر نوار انتخاب افکت‌ها نیز یک امکان جدید Manage اضافه شده که به کاربر اجازه می‌دهد باتوجه به سلیقه‌اش در استفاده از افکت‌ها، ترتیب نمایش آن‌ها را تغییر دهد یا هرکدام را که نمی‌پسندد پنهان نماید. دکمه خورشید سعی می‌کند نور و کنتراست تصویر را به صورت خودکار تغییر دهد که این گزینه نیز قابل تنظیم شدت است.

دکمه آچار امکانات بسیار بیشتری را فراهم می‌کند:

Straighten: برای صاف کردن و یا کج کردن تصاویر به کار می‌رود. توجه داشته باشید که این عمل با زوم کردن روی تصویر امکان‌پذیر می‌شود.

Brightness: جهت تنظیم روشنایی.

Contrast: جهت تنظیم کنتراست یا تضاد.

Warmth: جهت تنظیم درجه گرمی رنگ‌ها.

Saturation: جهت تنظیم اشباع رنگ

Highlights: جهت تنظیم شدت روشنایی بخش‌های روشن تصویر

Shadows: جهت تنظیم شدت روشنایی سایه‌‌ها و بخش‌های تاریک تصویر

Vignette: افزودن یک هاله تاریک در اطراف تصویر

Tilt Shift: شبیه‌سازی عملکرد دوربین‌های پیشرفته DSLR با عمق میدان کم برای ایجاد افکت خارج از فوکوس بودن قسمتی از تصویر

Sharpening: برای تیزکردن لبه‌ها و جبران تار بودن عکس

آموزش اینستاگرام / به اشتراک گذاری و یا ارسال خصوصی
در صفحه بعد می‌توانید توضیحی برای تصویرتان بنویسید و در این توضیح از هش‌تگ‌ها استفاده کنید. با قراردادن علامت # پیش از یک کلمه (مثلاً #باران) آن کلمه لینک می‌شود و اگر کسی در اینستاگرام هش‌تگ باران را جستجو کند تصویر شما را خواهد دید. همچنین با لمس هش‌تگ‌ها هنگام مرور تصاویر به صفحه‌ای با تمامی عکس‌های آن هش‌تگ خاص راهنمایی می‌شوید.

Instagram-step-3
همچنین در قسمت تصاویر (و یا نظرات) می‌توانید با قرار دادن علامت @ پیش از نام کاربری شخص خاصی از دوستانتان او را اصطلاحاً Mention کنید تا هشداری برای شخص ارسال شود. این کار معمولاً برای جلب توجه دوستانتان به تصویر خاصی و یا پاسخ دادن به آن‌ها استفاده می‌شود.

اگر تصویر شما یک عکس دسته‌جمعی است می‌توانید با انتخاب Tag people و لمس چهره‌های اشخاص آن‌ها را تگ کنید. سپس می‌توانید تگ را با کشیدن و رها کردن جابجا کرده و یا با لمس حذف کنید.

گزینه Add to Photo Map مکان فعلی شما را به تصویر اینستاگرامتان اضافه می‌کند تا در قسمت نقشه تصاویر یا Photo Map دوستانتان بتوانند روی نقشه عکس‌هایی را که در جاهای مختلف دنیا گرفته‌اید مشاهده کنند.

در آخر هم می‌توانید از قسمت Share تصویرتان را در شبکه‌های احتماعی مانند فیس‌بوک و یا توییتر به اشتراک بگذارید.

اگر در این صفحه از بالا زبانه Followers را انتخاب کنید تصویر برای تمامی دنبال‌کنندگان شما نمایش داده می‌شود و اگر Direct را انتخاب کنید می‌توانید تصویر را به صورت خصوصی برای فرد یا افراد خاصی ارسال کنید.

آموزش اینستاگرام / دایرکت اینستاگرام
در واقع از نام این سرویس می‌توان به اصلی‌ترین قابلیت آن یعنی برقراری ارتباط مستقیم پی برد. در واقع اگر قصد دارید تصویری را تنها برای عده کمتری از کاربران (از یک تا ۱۵ نفر) ارسال کنید و یا اگر قصد ارتباط گرفتن با یکی از کاربران را دارید اما تنها به اکانت اینستاگرام او دسترسی دارید این سرویس می‌تواند چاره‌ساز باشد. برای آموزش کامل استفاده از این قابلیت می‌توانید مطلب آموزش کامل استفاده از قابلیت دایرکت اینستاگرام را در فارنت بخوانید.

پنج – مرور و یافتن تصاویر و دوستان
Instagram-Step-4
اگر دکمه قطب‌نما (دکمه دوم از سمت چپ) را لمس کنید با تصاویری از سراسر دنیا مواجه می شوید که می‌توانید در این قسمت با فشردن دکمه ذره‌بین بالای صفحه در زبانه Users نام کاربری دوستانتان را پیدا کنید و آن‌ها را دنبال (Follow) کنید. به این ترتیب هرگاه تصویر جدیدی را قرار دهند شما می‌توانید آن را در قسمت Home یا صفحه خانگی اینستاگرام مشاهده کنید.

اگر به موضوع خاصی علاقه‌مند هستید با فشردن دکمه ذره‌بین بالای سمت راست صفحه در زبانه TAGS می‌توانید آن را جستجو کنید تا تمامی تصاویری که با هش‌تگ دلخواهتان قرار گرفته را مشاهده کنید. برای یافتن کاربران از طریق نام کاربری می‌توانید زبانه USERS را انتخاب کنید.

همچنین برای یافتن دوستانی که نام کاربری آن‌ها را در اینستاگرام ندارید می‌توانید از نوار پایین صفحه اولین دکمه سمت راست را انتخاب کرده و دکمه سه نقطه را در بالای صفحه برای ورود به تنظیمات فشار دهید. حالا وارد گزینه اول یعنی Find friends شوید و از آن‌جا قادر خواهید بود دوستانتان را با استفاده از لیست مخاطبین تلفن و یا فیس‌بوک پیدا کنید.

توجه داشته باشید که به علت محدودیت اینستاگرام بهتر است در هر ساعت بیش از حدود ۲۰۰ تصویر را لایک نکنید و یا بیش از ۵۰ نفر را فالو یا آنفالو نکنید. همچنین بیش از حد نیز از نظر گذاشتن و یا ارسال دایرکت خودداری کنید.
آموزش اینستاگرام / اعلان‌ها یا نوتیفیکیشن‌ها
Instagram-Step-5
از آن‌جایی که اینستاگرام را می‌توان به نحوی یک شبکه اجتماعی محسوب کرد اعلان‌هایی نیز برای آن پیش‌بینی شده است. با مراجعه به تنظیمات و انتخاب گزینه Push Notification Settings می‌توانید تنظیم کنید که هنگامی که فردی تصویر شما را لایک می‌کند، نظری می‌نویسد، شما را دنبال می‌کند و یا در عکسی تگ می‌شوید به شما اعلانی داده شود. همچنین در صفحه اصلی دکمه دوم از سمت راست مربوط به News یا اخبار است. در زبانه You می‌توانید این اعلان ها را ببینید و در بخش Following متوجه شوید که دوستانتان چه تصاویری را لایک کرده‌اند و یا چه کسانی را دنبال کرده‌اند.

آموزش اینستاگرام / ارسال به شبکه‌های اجتماعی
اگر دوست دارید تصاویر اینستاگرامتان را در شبکه‌های اجتماعی هم به اشتراک بگذارید می‌تواند در قسمت تنظیمات گزینه Sharing Settings را انتخاب کرده و اکانت‌هایی مانند فیس‌بوک، توییتر، فلیکر، تامبلر و Foursquare را به آن اضافه کنید. سپس می‌توانید تنظیم کنید که در کدام قسمت از هر شبکه تصویر شما به اشتراک گذاشته شود.

پاسخ به چند سوال رایج آموزش اینستاگرام :
آموزش اینستاگرام 
به اشتباه به فردی اجازه دنبال کردن داده‌ام؛ راه چاره چیست؟
تنها راه بلاک کردن کاربر مورد نظر است. برای این کار وارد پروفایلش شوید و دکمه سه نقطه را فشار دهید و سپس Block User را انتخاب کنید.

چگونه تصاویر اینستاگرام خودمان را یک‌جا دانلود کنیم؟
اینستاگرام برای این کار سرویس Instaport را پیشنهاد می‌دهد. کافیست وارد این سایت شده و با اکانت اینستاگرام خود لاگین کنید. سپس می‌توانید تمام یا قسمتی از تصاویرتان را به صورت یک فایل زیپ دانلود کنید.

چگونه تصاویر اینستاگرام دیگران را ذخیره کنیم؟
اینستاگرام به صورت پیش‌فرض اجازه ذخیره تصاویر را به شما نمی‌دهد اما از آن‌جایی که به هر حال تصاویر هنگام به اشتراک‌گذاری تا اندازه 612 در 612 پیکسل کوچک می‌شوند اگر از گوشی‌های با وضوح 720p به بالا استفاده می‌کنید می‌توانید از صفحه اسکرین‌شات بگیرید و قسمت مورد نظر را جدا کنید. راه دیگر ورود به پروفایل اینستاگرام اشخاص از طریق وب‌سایت است؛ برای این‌کار نام کاربری شخص مورد نظر را با یک علامت “/” پس از آدرس instagram.com وارد کنید. به طور مثال اگر قصد دارید کاربر “farnet.io” را دنبال کنید کافیست وارد آدرس instagram.com/farnet.io شوید و سپس تصویر مورد نظرتان را ذخیره کنید.

چگونه خطاب به کسی چیزی بنویسیم؟
برای این‌کار همان‌طور که پیش از این اشاره شد علامت @ را پیش از نام کاربری او بنویسید تا به اصطلاح او را Mention کرده باشید.

چگونه تصاویرمان را حذف کنیم؟
با باز کردن هر عکس و فشردن سه نقطه پایین صفحه می‌توانید تصاویر مورد نظرتان را حذف کنید.

چگونه کاربری را بلاک کنیم؟
همان‌طور که توضیح دادیم وارد پروفایلش شوید و دکمه سه نقطه را فشار دهید و سپس Block User را انتخاب کنید. توجه کنید که مانند فیس‌بوک اگر کسی را در اینستاگرام بلاک کنید فرد مورد نظر متوجه نخواهد شد.

چگونه تاریخچه جستجوها را پاکسازی کنیم؟
وارد تنظیمات شده و Clear Search History را انتخاب کنید.

چگونه کاربری را از بلاک خارج کنیم؟
مراحل کار مشابه بلاک کردن کاربر است؛ تنها Unblock را انتخاب کنید.

چگونه نظرات دیگران را روی تصاویرمان حذف کنیم؟
تصویر مورد نظر را باز کنید و در صفحه ثبت نظرات دکمه شکل مداد را فشار دهید. حالا می‌توانید نظرات دلخواه را حذف کنید.

چگونه نظراتمان را روی تصاویر دیگران ویرایش یا حذف کنیم؟
مشابه سوال قبل.

چه کنیم تا هر کسی قادر به دیدن تصاویرمان نباشد؟
همان‌طور که گفتیم باید به پروفایل خود بروید و با زدن سه نقطه بالا سمت راست وارد تنظیمات شوید و Private Account‌ را روشن کنید

چگونه تصاویر را تنها با اینستاگرام ویرایش کنیم اما به اشتراک نگذاریم؟
کافیست پس از گرفتن عکس و اعمال افکت‌ها در مرحله Share به عملیات ادامه ندهید. تصویر در پوشه Instagram گوشی ذخیره شده است.

چگونه می‌توانیم در اینستاگرام از شکلک‌های یا Emojiها استفاده کنیم؟ 
برای این‌کار می‌توانید از کیبردهای دارای شکلک‌ها مانند Google Keyboard، Kii Keyboard و یا Swiftkey استفاده کنید. پس از نصب کیبرد باید با مراجعه به تنظیمات اندروید در بخش Language and Keyboard یا “زبان و ورودی” کیبرد نصب شده را فعال کنید.

شات‌اوت به چه معناست و چگونه می‌توانیم فردی را شات‌اوت کنیم؟
 Shotout در واقع روشی برای تبلیغ صفحه فرد مورد نظرتان است. برای شات‌اوت کردن می‌توانید از صفحه اینستاگرام فرد مورد نظر عکس گرفته و یا تصویر پروفایل او را قرار دهید و نام او را بر روی عکس (همان‌طور که در بالا گفته شد) تگ کنید و در توضیحات از دوستان و دنبال‌کنندگان خود بخواهید او را نیز Follow کنند.

کار مشابهی را با ارسال تصویر به صورت Direct برای دنبال‌کنندگانتان نیز می‌توانید انجام دهید.

Kik چیست و به چه معناست؟ 
کیک یک اپلیکیشن مستقل پیام‌رسان مانند واتس‌اپ و دیگر اپلیکیشن‌های مشابه است که برای ثبت نام یا یافتن دوستان به شماره نیازی ندارد و ارتباط از طریق آی‌دی صورت می‌گیرد. Kik را می‌توانید از گوگل‌پلی یا بازار برای اندروید یا اپ‌استور آیفون دانلود کنید.

برای چت کردن با کاربران اینستاگرام چه می‌توان کرد؟ 
قابلیتی مشابه در اینستاگرام به نام Direct Message وجود دارد؛ برای آموزش کامل آن به این مطلب مراجعه کنید. اینستاگرام پیش از این قابلیت چت کردن را نداشت و به همین دلیل برخی کاربران از سرویس InstaMessage (آیفون / اندروید) استفاده می‌کردند.

قادر به قرار دادن ویدئو در اینستاگرام نیستم. 
از نظر اینستاگرام دوربین گوشی شما احتمالا کیفیت لازم استاندارد حداقل اینستاگرام را ندارد. ممکن است بتوانید با تبدیل فرمت ویدئوی مورد نظر به MP4 در کامپیوتر و امتحان مجدد موفق شوید.

آیا می‌توانم با کامپیوتر و از طریق سایت از اینستاگرام استفاده کنم. 
از طریق وب‌سایت تنها امکان مشاهده تصاویر وجود دارد و قادر به قرار دادن عکس نخواهید بود.

پس از مدتی دیگر قادر به لایک تصاویر یا فالو کردن افراد نیستم. 
احتمالاً در مدت کوتاهی بیش از حد تصاویر را لایک کرده یا افراد زیادی را فالو کرده‌اید و از طرف اینستاگرام محدود شده‌اید. با توجه به حجم نفراتی که فالو کرده‌اید بعد از مدت نامشخص این محدودیت رفع خواهد شد. هیچ راه دیگری جز صبر کردن ندارد و احتمالاً مسدود شدن حساب شما در صورت تکرار این موضوع وجود دارد.
بعضی یا تمامی تصاویر اینستاگرام برای من لود نمی‌شوند.
 مشکل از اتصال اینترنت و ارتباط با سرور اینستاگرام است. برخی ISPهای داخلی اتصال اینستاگرام را محدود یا قطع کرده‌اند و ممکن است مشکل از انواع تحریم‌های داخلی یا خارجی باشد که همگی با آن آشنایی داریم!

پسورد اکانت اینستاگرام خود را فراموش کرده‌ام؛ چکار کنم؟
 از گزینه Forget Password استفاده کنید تا پسورد جدید به ایمیل شما ارسال شود

فردی متوجه رمز اکانت من شده و آن را تغییر داده است؛ چکار کنم؟ 
مشابه سوال قبل

اینستاگرام مرا مجبور به برش عکس می‌کند. چگونه تصاویر را به صورت کامل قرار دهیم؟ 
استاندارد اینستاگرام تصاویر مربعی با نسبت 1:1 است و بهتر است از دوربین خود اینستاگرام استفاده کنید؛ اما در صورتی که قصد دارید عکسی مستطیلی را به صورت کامل قرار دهید از برنامه‌هایی نظیر No Crop (اندروید / آیفون) یا InstaSize (اندروید / آیفون) استفاده کنید تا تصویر کوچک شده و در مربعی سفید یا مشکی قرار بگیرد و سپس آن را در اینستاگرام وارد کنید.

چگونه در اینستاگرام به جای عکس، متن و نوشته قرار دهیم؟ 
از اپلیکیشن‌هایی مانند Textgram (اندروید / آیفون) یا InstaQuote (اندروید / آیفون) استفاده کنید.

چطور می‌توان متوجه شد چه کسی از صفحه ما بازدید کرده است؟ 
چنین امکانی وجود ندارد.

چگونه می‌توان چند عکس یا ویدئو را کنار یکدیگر و در قالب یک عکس یا ویدئو قرار داد؟ 
برای این‌کار از اپلیکیشن‌هایی مانند VidStich (اندروید / آیفون) برای ویدئو و تصویر و یا Pixlr Express (اندروید / آیفون) برای تصاویر استفاده کنید.

چگونه اکانت خود را در اینستاگرام غیرفعال/حذف کنیم؟ 
در صورت تمایل برای حذف همیشگی اکانت خود می‌توانید از وب‌سایت این برنامه و طبق این آموزش این کار را انجام دهید.

پس از اجرای برنامه با پیام Incompatible Device مواجه می‌شوم؛ مشکل از کجاست؟ 
گوشی شما با اینستاگرام سازگار نیست. ممکن است نسخه‌های قدیمی اینستاگرام چنین مشکلی نداشته باشد.

چگونه می‌توان وقتی کسی ما را Unfollow کرد متوجه شویم یا بدانیم چه کسانی ما را متقابل فالو نمی‌کنند؟ 
از اپلیکیشن کمکی InstaFollow برای اندروید یا Followers For Instagram برای آیفون کمک بگیرید.

چگونه از قاب‌ها و افکت‌های بیشتری استفاده کنیم؟ 
اپلیکیشن‌هایی مانند InstaShape (اندروید / آیفون) و یا Pixlr Express (اندروید / آیفون) استفاده کنید.

اینستاگرام قادر به تشخیص موقعیت من نیست. 
احتمالاً شبکه‌های وای‌فای و مخابراتی برای تعیین موقعیت کافی نیستند. GPS گوشی را روشن کرده و در فضای آزاد امتحان کنید. ضمناً چک کنید که برنامه‌های مسیریابی مانند Google Maps به درستی مکان شما را پیدا می‌کنند.

آیا می‌توان عکسی را تنها برای فالورهای خاصی نمایان یا مخفی کرد؟ 
خیر. تمامی افرادی که شما را دنبال می‌کنند قادر به دیدن تمامی تصاویر شما خواهند بود.‌اگر می خواهید تصویر خاصی را برای عده ای ارسال کنید باید از دایرکت استفاده کنید که بالاتر توضیح دادیم.

آیا می‌توان لیست فالورها یا فالویینگ‌های خود را مخفی کرد؟ 
خیر. تمامی افرادی که شما را دنبال می‌کنند قادر به دیدن فالورها و فالویینگ‌های شما هستند و تنها می‌توانید با Private کردن پروفایل خود پس از اجازه شما امکان دنبال کردنتان را به کاربران بدهید.

چه فعالیت‌هایی باعث بلاک شدن و محدود شدن اکانت می‌شود؟ 
قرار دادن تبلیغات در قسمت نظرات / ارسال تصاویر حاوی خشونت، کلمات رکیک یا تصاویر عریان / ارسال بیش از حد دایرکت / فحاشی / استفاده از اینستاگرام بر روی چند گوشی و با چندین آی‌پی متفاوت در طول مدت کوتاه

اکانت من محدود (بلاک) شده و امکان فالو/لایک/کامنت ندارم؛ چقدر باید برای رفع این محدودیت صبر کنم؟
به گفته اینستاگرام این محدودیت ممکن است از چند ساعت تا چند روز طول بکشد و همچنین راهی به جز صبر کردن ندارید.

برای بسته شدن یک اکانت چند نفر باید آن را ریپورت کنند؟
بسته شدن اکانت به تعداد ریپورت بستگی ندارد و این عمل به صورت خودکار انجام نخواهد شد. اگر ریپورت درست و صحیح باشد تیم پشتیبانی اینستاگرام به تشخیص خود اکانت شخص خاطی را مسدود خواهند کرد.

چگونه در اینستاگرام مانند فیس‌بوک پیج بسازم؟
در اینستاگرام چیزی تحت عنوان پیج وجود ندارد و در واقع می‌توانید مانند روال ساخت یک اکانت عادی صفحه‌ای به عنوان یک پیج باز کنید.

در هنگام فالو کردن برخی کاربران، افرادی به عنوان پیشنهاد یا Suggestion نشان داده می‌شوند آن‌ها را برای اکانت خودم چگونه تغییر دهم؟
افراد پیشنهادی کاملا در اختیار اینستاگرام است و در اختیار شما نیست. حداقل در نسخه فعلی امکان تغییر افراد پیشنهادی وجود ندارد و معیار اینستاگرام برای انتخاب افراد پیشنهادی رسما اعلام نشده است. شما می‌توانید با استفاده از کامپیوتر و مراجعه به آدرس اینترنتی اینستاگرام و ورود به پروفایل خود در بخش تنظیمات این گزینه را غیرفعال کنید.

برای این کار از طریق مرورگر اینترنتی به اینستاگرام مراجعه و لاگین کنید. بالای صفحه روی اسم خودتون بزنید تا وارد صفحه پروفایلتون به شه. حالا دوباره روی ادیت پروفایل بزنید و بعد پائین صفحه تیک کنار گزینه Include your account when recommending similar accounts people might want to follow. رو بردارید و بعد دکمه Submit رو بزنید تا ذخیره بشه. تمام

پیغام comment blocked در هنگام گذاشتن کامنت در اینستاگرام به چه معناست؟
این پیغام به این معنی است که شما از گذاشتن کامنت در تصاویر این شخص برای همیشه و یا کل تصاویر در اینستاگرام به مدت محدود (اما نامعلوم) محروم شده‌اید. این موضوع وقتی اتفاق می‌افتد که در زیر تصایویر دیگران اسپم و کامنت های تبلیغاتی بگذارید. تکرار این عمل باعث بسته شدن اکانت شما برای همیشه خواهد شد.

هنگام ثبت نام با پیامی با متن «too many users have been registered on this device» مواجه می‌شوم؛ چاره چیست؟

ظاهراً کاربران زیادی با گوشی شما ثبت نام کرده‌اند؛ بهترین راه استفاده از یک گوشی یا تبلت دیگر برای ثبت نام است.

زمان ثبت‌نام با این پیام روبرو می‌شوم: «The IP address you are using has been flagged as an open proxy»؛ چاره چیست؟
راحت‌ترین راه رفع این مشکل اینه که از یک اینترنت دیگه برای ثبت‌نام استفاده کنید.

در هنگام مشاهده تصاویر گاهی با پیغام خطای «Couldn’t refresh feed» یا «an unknown network error has occurrred» مواجه می‌شوم و تصاویر و صفحات بارگذاری نمی‌شوند.
بنابه اعلام وزیر ارتباطات اختلالات اینستاگرام به دلیل فیلترینگ هوشمند (؟!) ایجاد شده است. می‌توانید شکایات خود را از طریق وب‌سایت کارگروه مصادیق مجرمانه ثبت و پیگیری نمایید. با این وجود می‌توانید مشکل خود را با سرویس دهنده اینترنتتان مطرح کرده یا از اینترنت دیگری استفاده کنید.

مشکل درخواست کد امنیتی در اینستاگرام:
در هنگام باز کردن صفحه اینستاگرام، صفحه ای باز می‌شود که از من کد امنیتی می‌خواهد. راه‌حل چیست؟
پاسخ: این مشکل به این دلیل است که در هنگام ثبت‌نام شماره تلفن همراه خود را وارد نکرده‌اید. برای رفع مشکل شماره تلفن همراه خود را وارد کرده و منتظر دریافت کد بمانید. این کار را فقط برای یک بار انجام دهید و در صورت عدم دریافت کد آن را با یک شماره همراه دیگر ترجیحاً غیر از همراه اول امتحان کنید. از ارسال چندین باره درخواست خودداری کنید چون با انجام این کار کدهای ارسال شده قبلی که احتمالاً دریافت خواهید کرد نامعتبر شده و پس از چندین مرتبه دیگر کدی برایتان ارسال نخواهد شد. این مشکل راه‌حل دیگری ندارد!

مدتی هست که نمی‌توانم لایک یا فالو کنم و موقع لایک و فالو کردن یک صفحه سفید باز می‌شود؟
احتمالاً به علت لایک و فالو کردن زیاد در مدت زمان کم  یا دلایل دیگر از طرف اینستاگرام بلاک شدید ولی علت اصلی مشکل ایجاد شده در همان صفحه سفید است که صفحه مورد نظر دیر باز  می‌شود و در اکثر موارد به علت سرعت پایین اینترنت اصلاً باز نمی‌شود پس یا باید صبر کنید و یا روش‌های دیگر برای تغییر آی‌پی را امتحان کنید! سپس با وارد کردن کد امنیتی که خود اینستاگرام به شما می‌دهد می‌توانید مشکل را برطرف کنید.
درضمن در بعضی موارد صفحه ای باز می‌شود که درخواست شماره تلفن برای فرستادن کد امنیتی می‌کند، پس از وارد کردن شماره همراه با کد +۹۸ کد امنیتی فرستاده خواهد شد ولی در بیشتر موارد برای اپراتورهای ایران کدی فرستاده نمی‌شود که دلیل آن مشخص نیست پس بهتر است در هنگام ثبت‌نام حتماً شماره همراه را نیز وارد کنید.

چگونه می‌توانم عکس خود را در بخش Explore قرار دهم؟
بخش Explore برای هر کاربر متفاوت بوده و بسته به علایق، دوستان و تصاویری که دوستان شما لایک کرده‌اند تغییر می‌کند. بنابراین قرار دادن تصویرتان در این صفحه غیرممکن است!

چگونه می‌توانم چندین کاربر را به صورت همزمان آنفالو کنم؟
آنفالو کردن تعداد زیاد کاربر در یک روز به هیچ وجه توصیه نمی‌شود. فالو کردن تعداد کاربران زیاد برای دریافت فالوبک و آنفالو کردن آن‌ها احتمالاً موجب غیرفعال شدن همیشگی اکانت شما از سوی اینستاگرام خواهد شد.

چگونه در اینستاگرام همزمان بیش از یک اکانت داشته باشم؟
قابلیت استفاده همزمان از چند اکانت در اینستاگرام به تازگی به این شبکه اجتماعی اضافه شده است. برای آموزش استفاده و جزئیات بیشتر به این مطلب مراجعه کنید.

چگونه می‌توانم پیام دایرکتی را که ارسال کرده‌ام لغو کنم؟
کافیست انگشت خود را روی پیام نگه داشته و Unsend Message را بزنید. اگر مخاطب شما پیش از Unsend کردن پیام شما را ندیده باشد اعلانی مبنی بر پیام از طرف شما دریافت خواهد کرد اما قادر به مشاهده آن پیام نخواهد بود.

چگونه می‌توانم لینک پروفایل یا کانال تلگرام خود را در صفحه پروفایل اینستاگرام قرار دهم؟
متأسفانه این قابلیت توسط اینستاگرام مسدود شده و دیگر امکان قرار دادن لینک پروفایل تلگرام و یا اسنپ‌چت را ندارید. البته مطابق معمول
ما برای حل این مشکل راه‌حل‌هایی سراغ داریم که می‌توانید در این مطلب آن را بخوانید.

در هنگام ویرایش پروفایل با پیغام Links asking someone to add you on another service aren’t supported on Instagram. مواجه می شوم چاره چیست؟
به پرسش قبل مراجعه کنید.

خطای Your account has been disabled for violating our terms به چه معناست؟
اکانت شما به دلیل سرپیچی از قوانین اینستاگرام (فالو یا آنفالو زیاد در محدوده زمانی کم، جذب فالور به شیوه نامتعارف، استفاده از اپلیکیشن های جذب فالور، کامنت های تبلیغاتی، پست محتوای غیرقانونی و …) توسط اینستاگرام غیرفعال شده است. در حال حاضر راهی برای فعال کردن مجدد وجود ندارد.

چگونه می‌توانم تعداد فالورهای خود را با واحد K (هزار نفر) نمایش دهم؟

این تغییر به‌صورت خودکار و پس از رسیدن فالورها به چند هزار نفر توسط اینستاگرام انجام شده و در اختیار شما نیست.

نقطه آبی در اینستاگرام در هنگام جستجو به چه معناست؟

این نقطه به معنای پست جدید و دیده نشده از سوی کاربر مورد نظر است و ارتباطی به فعال یا آنلاین بودن ندارد.

مطلب آموزش اینستاگرام در تاریخ ۱۸ اسفند ۹۴ به‌روزرسانی شد – سؤالات رایج بیشتر به همراه پاسخ اضافه شد. لطفاً پیش از پرسیدن سؤال در بخش نظرات مطلب آموزش اینستاگرام را به طور کامل مطالعه کنید.
با توجه به تعداد زیاد کامنت‌ها و سوالات، امکان پاسخگویی به این گونه سوالات که به طور مکرر در بخش کامنت‌ها پاسخ داده شده و یا در بخش سوالات مرتبط پاسخ داده‌ایم را نداشته و سوال مربوطه برای انتشار تایید نخواهد شد.
سایر مطالب آموزشی مفید فارنت درمورد اینستاگرام:

چگونه اکانت خود را موقتاً غیرفعال کنیم؟
چگونه اکانت اینستاگرام خود را پاک کنیم؟
آموزش جامع دایرکت (پیام شخصی) در اینستاگرام
آموزش استفاده از چند اکانت همزمان در اینستاگرام
چگونه لینک تلگرام را در صفحه اینستاگرام خود قرار دهیم؟
چگونه از کامپیوتر در اینستاگرام تصویر قرار دهیم؟
آموزش کامل Stories در اینستاگرام برای تازه‌کارها
آموزش کامل ریپورت کردن در اینستاگرام
آموزش اینستاگرامآموزش کامل اینستاگرام
 ۲۴۶۸۰
 به اشتراک‌گذاریFacebookTwitterپست الکترونیک
مطالب پیشنهادی از سراسر وب
yektanet-logo-signپیشنهاد توسط
آربیتراژ اتوماتیک - ربات ترید آربیتراژ خودکار در صرافی های معتبر

سریع، ساده و ارزان از رمزپلاس تتر بخر
با بهترین قیمت تترهاتو نقد کنَ!

بمب افزایش فالوور و لایک اینستاگرام

لپ تاپ ، موبایل ، کامپیوتر ، کنسول قسطی بدون پیش پرداخت 36 ماهه

بوت کمپ برنامه نویسی مکتب شریف

باشگاه برنامه نویسی یاسان، ثبت نام یک جلسه رایگان(ویژه فرزندان 9تا 17)

آربیتراژ اتوماتیک - ربات ترید آربیتراژ خودکار در صرافی های معتبر
آربیتراژ اتوماتیک - ربات ترید آربیتراژ خودکار در صرافی های معتبر

سریع، ساده و ارزان از رمزپلاس تتر بخر
با بهترین قیمت تترهاتو نقد کنَ!
سریع، ساده و ارزان از رمزپلاس تتر بخر با بهترین قیمت تترهاتو نقد کنَ!

بمب افزایش فالوور و لایک اینستاگرام
بمب افزایش فالوور و لایک اینستاگرام

لپ تاپ ، موبایل ، کامپیوتر ، کنسول قسطی بدون پیش پرداخت 36 ماهه
لپ تاپ ، موبایل ، کامپیوتر ، کنسول قسطی بدون پیش پرداخت 36 ماهه

بوت کمپ برنامه نویسی مکتب شریف
بوت کمپ برنامه نویسی مکتب شریف

باشگاه برنامه نویسی یاسان، ثبت نام یک جلسه رایگان(ویژه فرزندان 9تا 17)
باشگاه برنامه نویسی یاسان، ثبت نام یک جلسه رایگان(ویژه فرزندان 9تا 17)

آربیتراژ اتوماتیک - ربات ترید آربیتراژ خودکار در صرافی های معتبر

سریع، ساده و ارزان از رمزپلاس تتر بخر
با بهترین قیمت تترهاتو نقد کنَ!

بمب افزایش فالوور و لایک اینستاگرام

لپ تاپ ، موبایل ، کامپیوتر ، کنسول قسطی بدون پیش پرداخت 36 ماهه

بوت کمپ برنامه نویسی مکتب شریف

باشگاه برنامه نویسی یاسان، ثبت نام یک جلسه رایگان(ویژه فرزندان 9تا 17)

شاید بخوای اینا رو هم بخونی:
آموزش تلفن همراه
امکان اضافه کردن مدیر به لایو اینستاگرام فراهم شد

اينترنت
الگوریتم اینستاگرام چگونه کار می‌کند؟؛ وقتی خود اینستاگرام رسما توضیح می‌دهد!

آموزش تلفن همراه
مشکل عدم دریافت کد امنیتی اینستاگرام را چگونه حل کنیم؟

موبایل
امکان پین کردن کامنت و محدود کردن منشن و تگ شدن توسط دیگران در اینستاگرام ممکن شد

آموزش
مشاهده لایو اینستاگرام در کامپیوتر و از طریق سایت امکان‌پذیر شد

اينترنت
امکان استفاده از دایرکت روی سایت اینستاگرام امکان‌پذیر شد | تمام چیزهایی که باید…

نوشتن دیدگاه
آدرس ایمیل شما منتشر نخواهد شد.

نظر شما

دیدگاه شما پس از بررسی توسط تحریریه منتشر خواهد شد. در صورتی که در بخش نظرات سوالی پرسیده‌اید اگر ما دانش کافی از پاسخ آن داشتیم حتماً پاسخگوی شما خواهیم بود در غیر این صورت تنها به امید دریافت پاسخ مناسب از دیگران آن را منتشر خواهیم کرد.

اسم شما *
ایمیل شما *
نام و آدرس ایمیل من رو برای دفعه بعد که کامنت می‌گذارم ذخیره کن

۲۴,۶۸۰ نظر برای این مطلب

سحر می‌گوید ۰۳:۰۳ دوشنبه, ۱۵ فروردین, ۱۴۰۱
سلام من پیج جدیدساختم امانمیتوانم تگ کنم فوقش فقط یک نفررامیتوانم تگ کنم مشکل ازکجاست؟


۰
 پاسخ

علیرضا محمدی می‌گوید ۰۳:۵۰ دوشنبه, ۱۳ دی, ۱۴۰۰
سلام
من قبلا آموزش اینستاگرام —- رو دیده بودم ولی خوب بخش استفاده از استیکرها و ایموجی ها رو درست توضیح نداده بود. شما در این آموزش خوبتون یک اشاره ای بهش کردید. ولی میشه آموزش کامل تری براش قرار بدید؟


۰
 پاسخ

حمید می‌گوید ۰۱:۱۴ چهارشنبه, ۱ دی, ۱۴۰۰
اینستاگرام پستهای بی حجاب وگناه زیادی دارد چرا تبلیغات می کنید


۰
 پاسخ

سینا می‌گوید ۱۰:۳۸ جمعه, ۱۹ آذر, ۱۴۰۰
بعد از آپدیت نمیتونم ویدیو بذارم و اگر هم بشه گذاشت مثل قبل نیست و فک کنم خود به خود به صورت ریلز میشه و نمیشه آرشیوش کرد فقط میشه حذف کرد . راهی هست که مثل قبل بشه؟


+۱
 پاسخ

ندا می‌گوید ۰۳:۵۰ پنجشنبه, ۴ آذر, ۱۴۰۰
سلام اینستاگرام من این پیغام آمده که یک سری فعالیتهای غیرمعمول دراینستاگرام داریدبخاطرهمین شمارالاگ اوت کردیم ظرف سی روزمراحل بعدی رابرو تاناحساب اینستاگرام شمارابه شمابرگردانیم مراحل بعدی بایدچکارکنم که حسابم رابرگردانند


+۱
 پاسخ

عرفان می‌گوید ۱۰:۳۲ دوشنبه, ۱ آذر, ۱۴۰۰
سلام ببخشید من سه تا از آکانتم در عرض سه ماه خود به خود حذف شدن با سرچ هم دیگه اسمشون نمیاد و دیگه نمیشه وارد شد یکی از آکانتم اینستاگرام پیام میاد که تشخیص چهره انجام بدم تا یک هفته پیش هم این پیام اومد ولی الان اکانتم حذف شد میخاستم بودم الان تصویر چهره م در اون پیج هست!؟


+۱
 پاسخ

سحر می‌گوید ۱۲:۴۱ سه شنبه, ۱۸ آبان, ۱۴۰۰
سلام باعرض معذرت که سوالی خارج ازموضوع اینستاگرام میپرسم من تلگرامم آخرین بروزرسانی راانجام دادم قبلامیتوانستم عکس ازتلگرام داخل گالری ذخیره کنم اماالان ذخیره نمیشودگزینه ذخیره درگالری وجودداردامادرگالری ذخیره نمیشود؟علت چیست؟


+۱
 پاسخ

سحر می‌گوید ۱۱:۰۰ چهارشنبه, ۱۹ آبان, ۱۴۰۰
سلام بابروزرسانی این مشکل تلگرام حل شد


+۱
 پاسخ

فریبرز می‌گوید ۱۲:۲۰ شنبه, ۱۷ مهر, ۱۴۰۰
با سلام .خسته نباشی مشکل من دقیقا نمیدونستم تا اینکه گفته شد که باید آپلود کنم که متاسفانه وارد نیستم .در اصل من نمیتونم عکس یا فیلمی ارسال کنم .دو گزینه بالا عکس العملی نشون نمیدن.لطفلا راهنمای کنید.ممنون


۰
 پاسخ

ندا می‌گوید ۰۳:۵۶ دوشنبه, ۵ مهر, ۱۴۰۰
سلام وقتتون بخیر ببخشید من یک نفری رو توی اینستاگرام رستریک کردم. الان که میخوادم خارجش کنم میزه
something went wtong،

اینستاگرام رو به آخرین نسخه آپدیت کردم. کش اینستا رو حذف کردم
IP
رو هم تغییر دادم.

حتی از طریق یه دیوایس دیگه و از طریق سایت هم اقدام کردم اما باز هم نشد و همون خطای قبلی رو میده

میشه محبت کنید و راهنمایی کنید


+۱
 پاسخ

ساسان می‌گوید ۰۲:۲۴ شنبه, ۶ شهریور, ۱۴۰۰
سلام این پیغام چیه
هیچ گزینه ندارم تا اینستاگرامم وارد بشم فقط عکس قفل میاد با این متن انگلیسی
onfirm Your Info on the App to Get Back to Your Account
We noticed unusual activity from your account. Confirm your identity from the Instagram app to get back to your account.


+۲
 پاسخ

سحر می‌گوید ۰۶:۳۱ شنبه, ۱۶ مرداد, ۱۴۰۰
سلام دیلزرادراینستاگرام چطوری فعال کنیم؟


+۲
 پاسخ

علی تهرانی می‌گوید ۰۶:۲۰ دوشنبه, ۴ مرداد, ۱۴۰۰
سلام جان هرکی دوست داری نجاتم بده اول اینکه یکی اکانت بیزینس من وقتی اینستا رو میبندم و دوباره باز میکنم یه پیغام میاد که خودکار لاگ اوت میشه و دوباره باید برم مراحل لاگین رو انجام بدم تا وارد بشم رمز این اکانت رو هم عوض کردم باز هم درست نشده و هر بار باید این کار رو انجام بدم الان هم برای همین اکانت پست هام شیر نمیشه آپلود نمیشه تمام کارهایی که باید انجام بدم تغییر آی پی بررسی api پاک کردن کش همه و همه رو انجام دادم نشد چه کنم خواهشا جواب بدید پیج بیزینس یک کا فالوور فعال دارم ممنونم


+۱
 پاسخ

ساسان می‌گوید ۰۲:۱۹ جمعه, ۲۵ تیر, ۱۴۰۰
سلام
تعداد لایک های پست های اینستا را مخفی کردم ولی با مرورگر و همچنین اکانت خودم با اپ اندروید زیر پست ها تعداد لایک ها دیده میشن چرااااا؟


+۲
 پاسخ

ساسان می‌گوید ۱۰:۳۰ پنجشنبه, ۱۷ تیر, ۱۴۰۰
آیا برای بیزنسی کردن پیج اینستاگرام باید اکانت فیسبوک داشته باشم؟
سوال بعدی میشه پیج پرایوت را بیزنسی کرد؟


+۱
 پاسخ

علی ارغوان می‌گوید ۰۶:۰۲ پنجشنبه, ۱۷ تیر, ۱۴۰۰
۱. بله نیاز به صفحه فیس‌بوک هست
۲. خیر ماهیت صفحه بیزنس و کسب‌وکار عمومی بودنشه


+۱
 پاسخ

M می‌گوید ۱۲:۱۴ سه شنبه, ۱ تیر, ۱۴۰۰
سلام اگر درخواست دلیت اکانت اینستاگرام رو داده باشم و بخوام درخواستم رو لغو کنم چطوری باید این کار رو انجام بدم؟


+۱
 پاسخ

محسن صحافی می‌گوید ۰۸:۲۶ سه شنبه, ۱ تیر, ۱۴۰۰
سلام
امکان لغو درخواست وجود نداره بازم برای ورود تلاش کنید ضرر نداره


+۲
 پاسخ

علی می‌گوید ۰۴:۴۹ یکشنبه, ۲۳ خرداد, ۱۴۰۰
سلام،اگه تو پیج کسی قسمت فالوور ها اسم کسی رو جست و جو کنم،ایا صاحب پیج متوجه میشه؟ممنون


+۱
 پاسخ

علی ارغوان می‌گوید ۱۰:۰۶ یکشنبه, ۲۳ خرداد, ۱۴۰۰
خیر


+۱
 پاسخ

شقایق می‌گوید ۱۱:۳۱ یکشنبه, ۱۶ خرداد, ۱۴۰۰
سلام
خیلی وقته اینستا میخاد دکمه لایک را حذف کنه آیا پشیمون شده؟


۰
 پاسخ

علی ارغوان می‌گوید ۰۱:۰۱ یکشنبه, ۱۶ خرداد, ۱۴۰۰
دکمه رو حذف نکرده ولی تعداد لایک رو میشه مخفی کرد
آموزش مخفی کردن تعداد لایک در اینستاگرام و فیس‌بوک


۰
 پاسخ

Ftmh می‌گوید ۰۴:۵۸ یکشنبه, ۲ خرداد, ۱۴۰۰
سلام من اکانتمو دی اکتیو مردم ولی نشد الان دوباره هم امتحان میکنم ارور میده معذرت میخابمو این هفته دیگ نمیتونید دی اکتیو کنید ….ولی دی اکتیو نشده ک چیکار کنم😩


۰
 پاسخ

مریم می‌گوید ۰۱:۱۹ یکشنبه, ۲ خرداد, ۱۴۰۰
سلام
من سه روزه ک نمیتونم وارد پیجم بشم.. و یه صفحه سفید نمایش داده میشه ک روش نوشته برا احراز هویت باید ویدیو به اینستا ارسال کنم و خود اینستا فیلم میگیره و اشاره میکنه ب جهات مختلف صورت… بعد از اینکه این کار رو انجام میدم این فیلم تایید میشه ولی بازم نمیتونم وارد پیجم بشم و کل این مراحل دباره تکرار میشه.. باید چکار کنم؟ چرا ایجوری شده؟ و اینکه پیجم فیک نیس و هر روز توش فعالیت داشتم..


۰
 پاسخ

سوال می‌گوید ۰۳:۵۳ سه شنبه, ۲۱ اردیبهشت, ۱۴۰۰
سلام،اگه کسی منو بلاک کرده باشه،من اکانتم دی اکتیو کنم،ایا تو لیست بلاک طرف مقابل اکانت من باقی میمونه؟یعنی اکانت من نمایش داده میشه؟با تشکر


۰
 پاسخ

محسن صحافی می‌گوید ۰۸:۴۶ سه شنبه, ۲۱ اردیبهشت, ۱۴۰۰
سلام
اثری از اکانت شما باقی نمی مونه اما به این معنی نیست که از بلاک در بیایید. به محض فعال شدن همه چی مثل قبل میشه


۰
 پاسخ

نرگس می‌گوید ۰۴:۳۶ پنجشنبه, ۱۲ فروردین, ۱۴۰۰
سلام وقتتون به خیر من دوتا اکانت اینستا دارم و فقط یکی رو می خوام حذف کنم اما با مراحلی که شما توضیح دادین و لینک حذف اون پیجی رو میاره که نمی خوام حذفش کنم چه طور می تونم صفحه ی دیگه ی خودمو انتخاب و حذف کنم؟


۰
 پاسخ

محسن صحافی می‌گوید ۰۷:۴۸ پنجشنبه, ۱۲ فروردین, ۱۴۰۰
سلام
هر اکانت باید یک یوزرنیم و پسورد مخصوص به خودش رو داره. احتمال میدم که هر دو اکانت رو با یک شماره موبایل یا آدرس ایمیل ساختید. مشکل همینجاست.
موقع ورود باید یوزرنیم (آیدی) و پسورد اکانتی که می‌خواهید پاک کنید رو وارد کنید.


۰
 پاسخ

Z می‌گوید ۰۲:۱۹ دوشنبه, ۲ فروردین, ۱۴۰۰
سلام عیدتون مبارک
ویسی که دایرکت برام ارسال شده باز نمیشه ومیگه ازنسخه جدیداستفاده کنیداندرویدمن ۴.۲.۲هست هرچی میگردم نسخه جدیدروپیدا نمی کنم چیکارنم؟


+۱
 پاسخ

مونا می‌گوید ۱۱:۲۸ شنبه, ۳۰ اسفند, ۱۳۹۹
سلام عیدتون مبارک -یه مشکلی برام پیش اومده این پیام خطا چیه؟؟؟؟؟
We noticed unusual activity from your account so we’ve logged you out.
Follow the next steps within 30 days so we can try to get you back into your account before it’s disabled.
کد کپچا نشون نمیده فقط یه بار نشون داد اونم قسمتی از ش بود چیکار کنم؟؟؟؟


۰
 پاسخ

محسن صحافی می‌گوید ۰۵:۵۴ شنبه, ۳۰ اسفند, ۱۳۹۹
سلام
عبد شما هم مبارک
با فیلترشکن امتحان کنید


۰
 پاسخ

علی می‌گوید ۰۹:۴۷ شنبه, ۲۳ اسفند, ۱۳۹۹
سلام من دوبار پیجمو دیلیت زدم و کاملا حذف شد
الان که دوباره آیدی مو تو گوگل میزنم عکاسم دوباره
بالا میاد تو گوگل چیکار باید کنم؟؟


۰
 پاسخ

علی ارغوان می‌گوید ۱۱:۰۰ شنبه, ۲۳ اسفند, ۱۳۹۹
باید ببینید گوگل از چه سایتی پیدا کرده. ممکنه ارتباطی به اینستاگرام نداشته باشه


+۱
 پاسخ

مونا می‌گوید ۰۹:۰۴ پنجشنبه, ۲۱ اسفند, ۱۳۹۹
سلام
من سه سال روش های گوناگون امتحان کردم پیج هایی با محتوای متفاوت تا فالور و لایک به دست بیارم ولی موفق نشدم خودتون میدونید در اینستا جمع کردن لایک از فالور خیلی سخت تره. اما با گشت و گذار پیج های فالور بالا یه نکته عجیبی فهمیدم.
بعضی پست هاشون بیشتر از فالوراشون لایک میخوره فک کنم فیک باشن نظرتون چیه؟ از چه روشی استفاده میکنن اینا تا من از همین روش استفاده کنم
یک نمونه از پیج براتون میفرستم .یکی از پستاش شصت هزار لایک خورده ینی دو برابر تعداد فالوراش


+۱
 پاسخ

محسن صحافی می‌گوید ۱۲:۲۴ جمعه, ۲۲ اسفند, ۱۳۹۹
سلام
فقط رشد طبیعی و تولید محتوای مفید و منحصر به خودتون


+۱
 پاسخ

پرستو می‌گوید ۰۸:۴۱ سه شنبه, ۱۹ اسفند, ۱۳۹۹
سلام
پسوردم گم کردم و لینک ریست پسورد به گوشی پیامک نمیشه.ایمیل وارد نکرده بودم آیا راهی هست که حالا از اینستا بخواهیم ایمیل برای اکانت اینستاگرام وارد کنه؟


۰
 پاسخ

محسن صحافی می‌گوید ۱۰:۵۷ سه شنبه, ۱۹ اسفند, ۱۳۹۹
سلام
این مطلب رو بخونید:
https://farnet.io/1399/12/281060/how-to-fix-instagram-not-sending-security-code/


۰
 پاسخ

سحر می‌گوید ۰۵:۵۲ یکشنبه, ۱۷ اسفند, ۱۳۹۹
سلام اینکه دراستوری اینستاگرام لینک ورودبه جائی رامی گذارندمثلامیگویندازطریق لینک زیرواردبشویداین لینک راچطوردراستوری اینستاگرام می گذارنر


۰
 پاسخ

محسن صحافی می‌گوید ۰۶:۳۳ یکشنبه, ۱۷ اسفند, ۱۳۹۹
سلام
برای کاربران عادی فعال نیست و برای کاربران بیزینس یا کریتور و بالاتر از ۱۰ هزار فالور فعال می‌شود.


۰
 پاسخ

علی می‌گوید ۰۳:۳۲ جمعه, ۱۵ اسفند, ۱۳۹۹
سلام.بعضی کاربران در قسمت لوکیشن مربوط به پست اینستا لوکیشن explore زدن
آیا با این روش پست ها در اکسپلور دیده میشن؟؟؟؟


+۱
 پاسخ

محسن صحافی می‌گوید ۰۵:۱۸ جمعه, ۱۵ اسفند, ۱۳۹۹
سلام
خیر هیچ ارتباطی نداره و تاثیری در این موضوع نداره


+۱
 پاسخ

داود فائزی می‌گوید ۰۷:۰۴ یکشنبه, ۱۰ اسفند, ۱۳۹۹
سلام. چند روز قبل از اینستاگرام پیامی اومد که این پست شما بیست دلار هدیه گرفته. چگونه این پول رو برداشت کنم؟


+۱
 پاسخ

محسن صحافی می‌گوید ۱۱:۱۸ یکشنبه, ۱۰ اسفند, ۱۳۹۹
سلام
چنین چیزی وجود خارجی نداره و به طور معمول فیشینگ هست که به دنبال سرقت اکانت شما هستند. احتیاط کنید


+۱
 پاسخ

۳۴۵ می‌گوید ۰۳:۲۸ جمعه, ۸ اسفند, ۱۳۹۹
سلام، سوال درباره فیس بوک داشتم،
اگر از فیس بوک افرادی که دنبالشون نمیکنیم
بازدید کنیم و فیلم داخل صفحشون رو ببینیم آیا
متوجه میشوند که چه کسانی مشاهده کرده اند؟
وکلا اگر وارد صفحه فیس بوک دیگران بشیم
میفهمند؟


۰
 پاسخ

۳۴۵ می‌گوید ۱۱:۱۳ چهارشنبه, ۶ اسفند, ۱۳۹۹
سلام، سوال درباره فیس بوک داشتم،
اگر از فیس بوک افرادی که دنبالشون نمیکنیم بازدید کنیم وفیلم داخل صفحشون رو ببینیم آیا متوجه میشوند که چه کسانی مشاهده کرده اند؟
وکلا اگر وارد صفحه فیس بوک دیگران بشیم میفهمند؟


۰
 پاسخ

ملیحه گروسی می‌گوید ۰۱:۲۳ چهارشنبه, ۲۹ بهمن, ۱۳۹۹
سلام . من گوشیم و عوض کردم . برای انتقال اینستام به مشکل خوردم. اولش خواستم ریست پسورد کنم که تا مرحله آخر می‌رفت و نمیشد . چند تا ایمیل اومد که نشد . و چند پیام با نام فیس بوک !که اونم کمکی نکرد… در حالی که من فیس بوک ندارم و تو قسمت مشخصات شماره تماس و ایمیلم. رو هم قبل خارج شدن عوض کردم…الان برای وارد شدن با عبور جدید درخواست میزنم گزینه ایمیل حذف شده! گاهی کلا میگه با این اکانت کاربری نیست. گزینه پیام رو هم میزنم میگه برای ریست پسورد پیام فرستادن ولی چیزی نمیاد..ممکنه بگید چیکار کنم..من نمیخواهم اکانت جدید بسازم واقعا ،


۰
 پاسخ

ملیحه گروسی می‌گوید ۰۱:۲۲ چهارشنبه, ۲۹ بهمن, ۱۳۹۹
سلام . من گوشیم و عوض کردم . برای انتقال اینستام به مشکل خوردم. اولش خواستم ریست پسورد کنم که تا مرحله آخر می‌رفت و نمیشد . چند تا ایمیل اومد که نشد . و چند پیام با نام فیس بوک !که اونم کمکی نکرد… در حالی که من فیس بوک ندارم و تو قسمت مشخصات شماره تماس و ایمیلم. رو هم قبل خارج شدن عوض کردم…الان برای وارد شدن با عبور جدید درخواست میزنم گزینه ایمیل حذف شده! گاهی کلا میگه با این اکانت کاربری نیست. گزینه پیام رو هم میزنم میگه برای ریست پسورد پیام فرستادن ولی چیزی نمیاد..ممکنه بگید چیکار کنم..من نمیخواهم اکانت جدید بسازم واقعا ،


۰
 پاسخ

محسن صحافی می‌گوید ۰۹:۲۷ چهارشنبه, ۲۹ بهمن, ۱۳۹۹
سلام
راه رو درست انجام می‌دید. فقط فکر می‌کنم تکرار زیاد و پشت سر هم انجام دادن مراحل باعث میشه کدهایی که براتون ارسال میشه معتبر نباشه. یک بار درخواست بدید و منتظر بمونید.


۰
 پاسخ

فاطمه می‌گوید ۰۱:۴۳ دوشنبه, ۲۷ بهمن, ۱۳۹۹
سلام من چند روز پیش اینیستامو به روز رسانی کردم اولش خوب باز میشد اما بعدا یهو وقتی باز کردم رفت رو یه صفحه ای و نوشته بود شمارتان را تایید کنید شماره رو دادم اما هر چی منتظر میمونم کد امنیتی رو برام ارسال نمیکنه نمی‌دونم واقعا چی کار کنم😔😔😔😔😔😔


+۱
 پاسخ

علی می‌گوید ۰۵:۰۹ جمعه, ۲۴ بهمن, ۱۳۹۹
سلام
اگر کسی در پیجی غیر از پیج خودم به کامنتم پاسخ بده یا به اصطلاح منشن کنه و من برم اکانتش restrict کنم آیا جواب کامنتش برای من دیده نمیشه یا همه نمیتونن اون کامنت رو بخونن؟
به عبارت دیگری آیا راهی هست که در پیجی کامنت بزارم و کاربری به من پاسخ بده من نمیخام بقیه اون کامنت رو بخونن؟


۰
 پاسخ

محسن صحافی می‌گوید ۰۷:۲۶ جمعه, ۲۴ بهمن, ۱۳۹۹
سلام
رستریکت و محدودیت کامنت، صرفا مربوط به پست‌های خودتون هست


۰
 پاسخ

Yahya می‌گوید ۱۱:۱۱ یکشنبه, ۱۲ بهمن, ۱۳۹۹
سلام
دو سوال دارم : اولی میخوام عکس تو اینستا گرام بذارم ولی نمیاره.دومی اگه یه نفر ۵۰ هزار نفری همه فالوروش فالور کنیم چه باید کرد ممنون میشم جواب بدین.


۰
 پاسخ

محسن صحافی می‌گوید ۱۲:۱۳ یکشنبه, ۱۲ بهمن, ۱۳۹۹
سلام
با گفتن نمیاره نمیتونیم متوجه مشکل شما بشیم. باید پیامی که اینستاگرام اعلام می‌کنه رو توجه کنید و بگید
اگر منظورتون اینه که کل اون پنجاه هزار نفر به یکباره فالور شما بشن چنین امکانی وجود نداره


۰
 پاسخ

مریم می‌گوید ۰۶:۲۰ شنبه, ۴ بهمن, ۱۳۹۹
سلام من چرا همش میگه پسوردت اشتباس نمیدونم چطوری اکانتم رو ماک کنم میشه کمکم کنید😢


+۱
 پاسخ

ابوالفضل می‌گوید ۱۱:۲۶ سه شنبه, ۳۰ دی, ۱۳۹۹
سلام.پیج پی ویمو میخوام پاک کنم اما وقتی میام تو صفه پاک کردن پیج موارد پاک کردن برای پیج اصلیم ذکر میشه و میخواد پیج اصلیمو پاک کنه. مراحل حذفم بلدم ولی نمیدونم چکار باید کنم.


۰
 پاسخ

محسن صحافی می‌گوید ۰۲:۲۲ سه شنبه, ۳۰ دی, ۱۳۹۹
سلام
به این دلیل هست که شما از یک شماره موبایل و یا آدرس ایمیل برای ساختن هر دو اکانت استفاده کردید. هنگام ورود باید نام کاربری و پسورد اکانت مورد نظر خودتون رو انتخاب کنید تا به همون اکانت وارد بشه یا آدرس ایمیل و شماره موبایل اکانتی که قصد پاک کردنش رو دارید رو تغییر بدید.


۰
 پاسخ

Vakili می‌گوید ۱۲:۴۱ سه شنبه, ۲۳ دی, ۱۳۹۹
میخوام اکانتم حذف کنم ولی بصورت خودکار اکانت جدیدم میخواد حذف بشه چیکارکنم قبلی حذف بشه؟مثلا اون اکانت که من میخوام حذف بشه


۰
 پاسخ

محسن صحافی می‌گوید ۰۳:۲۷ سه شنبه, ۲۳ دی, ۱۳۹۹
سلام
هر اکانت یوزرنیم و پسورد خودش رو داره. شما احتمالا با یک شماره دو یا چند اکانت ساختید


۰
 پاسخ

A.V می‌گوید ۰۹:۰۷ دوشنبه, ۱ دی, ۱۳۹۹
سلام خسته نباشید ببخشید من ۴ تا اکانت اینستاگرام با یک ایمیل ساختم می خواهم ۳ تا از آن ها را پاک کن اگر بخواهم آنها را پاک کنم ۱ اکانت هم که مونده با همشون پاک می شه؟؟؟ من نمی خوام اون یک دونه پاک شه


۰
 پاسخ

محسن صحافی می‌گوید ۱۲:۱۶ سه شنبه, ۲ دی, ۱۳۹۹
سلام خب اشتباه کردید!
هر اکانت باید یک شماره موبایل یا آدرس ایمیل اختصاصی داشته باشه.
اگر یوزرنیم و پسورد هر اکانت رو دارید می‌تونید پاکش کنید و ارتباطی به آدرس ایمیل نداره. منظورم این هست که برای ورود از آیدی و پسورد همون اکانت استفاده کنید نه از ادرس ایمیل. بعد از ورود هم توجه کنید که کدوم اکانت هست بعد پاک کنید.


۰
 پاسخ

علی می‌گوید ۰۳:۵۷ پنجشنبه, ۲۱ اسفند, ۱۳۹۹
سلام من ارسال کد را از داخل اینستا غیر فعال کردم حالا می‌خوام پیجما دوباره بیار بالاتر ولی برام کد نمیاد چیکار کنم


۰
 پاسخ

محسن صحافی می‌گوید ۰۵:۱۷ پنجشنبه, ۲۱ اسفند, ۱۳۹۹
سلام
در مورد مشکل ارسال نشدن کد امنیتی اینتاگرام این مطلب رو بخونید:
https://farnet.io/1399/12/281060/how-to-fix-instagram-not-sending-security-code/


۰
 پاسخ

امیر گلرخ می‌گوید ۱۲:۱۷ چهارشنبه, ۲۶ آذر, ۱۳۹۹
سلام.وقتتون به خیر.من یه مشکلی توو اینستاگرام برام پیش اومده.تمام سواللت رو بررسی کردم ولی جوابم رو پیدا نکردم میشه راهتماییم کنین.
مشکلم اینه که نمیتونم پست بزارم.ینی مراحل رو انجام میدم ولی پستم ارسال نمیشه و دومی هم اینکه پیجم تبدیل به بیزینسی نمیشه.لطف میکنید اگه جوابم رو بدین
لطف میکنید ا


+۱
 پاسخ

حسن کشاورز می‌گوید ۰۹:۲۳ دوشنبه, ۸ دی, ۱۳۹۹
سلام خدمت دوستان عزیز
بعد از ایجاد حساب کاربری در اینستا هر کاری میکنم عکس و فیلم ارسال نمیشه نمیتونم چیزی به اشتراک بزارم حتی عکس پروفایل هم نمیتونم بزارم
ممنون میشم راهنمایی کنید. سپاس


+۱
 پاسخ

محسن صحافی می‌گوید ۱۰:۳۶ دوشنبه, ۸ دی, ۱۳۹۹
سلام
با گفتن نمی‌تونم نمیشه متوجه مشکل شد. اینستاگرام چه پیامی بهتون میده؟


۰
 پاسخ

Favakehi Shadi می‌گوید ۰۳:۰۲ دوشنبه, ۲۴ آذر, ۱۳۹۹
سلام با اینکه دیلیت اکانت کردم ولی پیامهام از دایرکت دیگران پاک نمیشه چرا؟و چیکار کنم که پاک بشه
ممنون


+۱
 پاسخ

محسن صحافی می‌گوید ۱۱:۲۵ دوشنبه, ۲۴ آذر, ۱۳۹۹
سلام
صبر کنید. صبر…


+۱
 پاسخ

Helma می‌گوید ۰۸:۳۸ پنجشنبه, ۶ آذر, ۱۳۹۹
بنظرم پاسخگویی به موقع وبجایی داده میشه ورسیدگی کامل انجام میشه…
توضیحات خوب وکاملی دراختیار مردم قرار دادین واقعا همه دیگه هیچ اشکالی برای نصب کردن اینستاگرام ندارن


۰
 پاسخ

سوگند می‌گوید ۰۹:۰۴ چهارشنبه, ۲۸ آبان, ۱۳۹۹
من قبلا کاری کردم برای کسایی ک منو فالو ندارن شمار پست هام صفرنشون بده الان میخام لغو کنم چیکار باید بکنم؟میخام کسیک فالوم نداره هم بدونه مثلا یدونه یا دوتا پست دارم بالا کنار شنار فالور ها و فالووینگ ها


۰
 پاسخ

محسن صحافی می‌گوید ۱۱:۱۱ چهارشنبه, ۲۸ آبان, ۱۳۹۹
سلام
چطوری این کار رو کردید میشه توضیح بدید! منظورتون احتمالا پرایوت کردن نیست!؟ اینستاگرام چنین تنظیماتی نداره!؟
ضمنا ابتدای ایمیل از www استفاده نکنید این نشانه برای ادرس سایت هست نه ایمیل.


۰
 پاسخ

مهسا می‌گوید ۱۲:۴۰ سه شنبه, ۴ آذر, ۱۳۹۹
سلام و خسته نباشید
آیا برنامه های اینستاویور درست کار میکند؟مثلا اگر کسی که جزو فالورهای اینستاگرام نباشد و از صفحه پرایوت بازدید کند.آیا با این برنامه ها متوجه میشویم؟


+۱
 پاسخ

علی ارغوان می‌گوید ۰۱:۴۲ پنجشنبه, ۶ آذر, ۱۳۹۹
خیر


+۱
 پاسخ

رزیتا می‌گوید ۰۸:۴۶ چهارشنبه, ۲۸ آبان, ۱۳۹۹
سلام صبح فارنتی ها بخیر
یک سایت آنفالویاب امن معرفی کنید؟
بعضی سایت ها فقط اپ دارن میخام با سایت لاگین کنم


+۱
 پاسخ

محسن صحافی می‌گوید ۱۱:۱۲ چهارشنبه, ۲۸ آبان, ۱۳۹۹
سلام
صبح شما هم بخیر
آنفالویاب امن نداریم :) هر انفالویابی باشه از نظر اینستاگرام غیرقانونی هست و دردسر میشه. توصیه می‌کنم صرفنظر کنید.


+۲
 پاسخ
 دیدگاه‌های قدیمی‌تر صفحه ۲۴۵ از ۲۴۵
PES2022-Gamenews
 پربازدیدترین

موبایل
اپل آپدیت IOS 15.6 و IPadOS 15.6 را برای رفع مشکلات مختلف منتشر کرد

موتور جستجوی روسی یاندکس در ایران رفع فیلتر شد؛ جایگزینی برای گوگل؟

۲ مرداد, ۱۴۰۱
نوبیا Z40S پرو ارزان‌ترین گوشی با اسنپ‌دراگون ۸ پلاس نسل ۱ معرفی شد

۳۰ تیر, ۱۴۰۱
سامسونگ: گوشی‌های تاشو در حال تبدیل شدن به ترند بازار هستند

۳۱ تیر, ۱۴۰۱
دل لپ‌تاپ گیمینگ G16 را با پردازنده نسل ۱۲ اینتل و نمایشگر ۱۶۵ هرتزی…

۱ مرداد, ۱۴۰۱
ایلان ماسک: کاربران توییتر افزایش اما درآمد آن کاهش یافته است!

۱ مرداد, ۱۴۰۱
قیمت گلکسی واچ ۵ و واچ ۵ پرو پیش از رونمایی رسمی فاش شد

۲ مرداد, ۱۴۰۱
iPhone 13 Series
آخرین مطالب فارنت

تصاویر مطبوعاتی گلکسی زد فلیپ ۴ سامسونگ پیش از رونمایی فاش…

۵ مرداد, ۱۴۰۱
مشخصات دوربین پیکسل ۷ و پیکسل ۷ پرو گوگل فاش شد

۵ مرداد, ۱۴۰۱
مانیتور گیمینگ لنوو Legion Y27q-30 معرفی شد

۴ مرداد, ۱۴۰۱
تراشه A16 اپل ۱۵ درصد CPU سریع‌تر و ۳۰-۲۵ درصد GPU سریع‌تر…

۴ مرداد, ۱۴۰۱
ساعت هوشمند ریلمی واچ ۳ با نمایشگر بزرگ ۱.۸ اینچی معرفی شد

۴ مرداد, ۱۴۰۱
مانیتور پرتابل فیلیپس با اندازه ۱۵.۶ اینچی رونمایی شد

۴ مرداد, ۱۴۰۱
شایعه: ساعت جان‌سخت اپل واچ پرو با طراحی جدید عرضه خواهد شد

۴ مرداد, ۱۴۰۱
نتایج بنچمارک انتوتو وان پلاس Ace پرو در آستانه معرفی آن…

۳ مرداد, ۱۴۰۱
لیست گوشی‌های شیائومی که آپدیت MIUI 14 را دریافت خواهند کرد

۳ مرداد, ۱۴۰۱
اولین تصاویر از قابلیت آواتار واتساپ منتشر شد

۳ مرداد, ۱۴۰۱
RSS گیم نیوز
فیلم‌های حاضر در جشنواره‌ی فیلم ونیز ۲۰۲۲ مشخص شدند
مارول بازگشت الیزابت اولسن را پس از وانداویژن به دیزنی پلاس تایید کرد
با ۱۰ فیلم پربازدید نت فلیکس در سال ۲۰۲۲ آشنا شوید
راهنمای بازی Stray – یازده نکته که باید پیش از آغاز بازی بدانید
فیلم ترسناک Nope در افتتاحیه‌ی آخر هفته فروش قابل قبولی داشت
تماشا کنید: باب ادنکیرک و شرکت در تست نقش مایکل اسکات سریال آفیس
جشنواره‌ی فیلم ونیز با فیلم White Noise با بازی آدام درایور افتتاح می‌شود
فروش فیلم Top Gun: Maverick در جهان به ۶۴۷ میلیون دلار رسید
فلش بک – بررسی بازی Resident Evil 3 – ویروس تی با چاشنی نمسیس
هاروی کیتل به National Treasure: Edge of History باز می‌گردد
   
SEO24

مطالب بیشتر
کورتانا مایکروسافت به‌درستی برندگان مسابقه یوروویژن را…

۴ خرداد, ۱۳۹۴
سامسونگ احتمالا گوشی پرچمدار جدیدی حتی ارزانتر از گلکسی اس…

۲۱ اسفند, ۱۳۹۷
بخش موبایل سونی در صورت تداوم زیان‌دهی در سال آینده به دردسر…

۱۵ مهر, ۱۳۹۴
فیس‌بوک
به ما در فیس‌بوک بپیوندید
 
توئیتر
به ما در توئیتر بپیوندید
 
اینستاگرام
به ما در اینستاگرام بپیوندید
 
تلگرام
به کانال تلگرام ما بپیوندید
 مطالب ویژه

آموزش/ چگونه اکانت اینستاگرام خود را پاک کنیم؟

جامع و کامل درباره «تورنت»

آموزش: چگونه اکانت اینستاگرام خود را به صورت موقت غیرفعال و از دسترس…

آموزش جامع اینستاگرام؛ از سیر تا پیاز!

عضویت در خبرنامه
عضویت در خبرنامه
مشترک خبرنامه فارنت شوید تا آپدیت بمانید!

ایمیل خود را وارد کنید ..
اشتراک
قدرت گرفته از MailChimp

داع‌ترین‌ها
آموزش دانلود از یوتیوب ، سایبرپانک ۲۰۷۷ ، نصب ویندوز از روی فلش ، آموزش تیک تاک ، استعلام اینترنت ایرانسل، کد بسته های مکالمه همراه اول ، دیلیت اکانت اینستاگرام ، تیک تاک چیست؟ ، آپدیت iOS 13 آیفون ،‌ یکاپ گرفتن از آیفون ، دایرکت اینستاگرام در کامپیوتر ، مشاهده ویدیوهای لایو اینستاگرام در کامپیوتر ، سیم کارت رایگان همراه اول  ، اخبار بازی ، پلی استیشن ۵ , نصب iOS 14 آیفون ، فیفا ۲۱ ،  بازی PES 2021 ، کلاب هاوس چیست ، کد امنیتی اینستاگرام ، دی اکتیو اینستاگرام

درباره ماهمکاری با فارنتتماس با مارپرتاژ در فارنت
فارنت با افتخار توسط سرورهای ابری و قدرتمند پارس‌پک میزبانی و پشتیبانی می‌شود. / سئو سایت توسط وب ۲۴ تمامی حقوق این وب‌سایت برای فارنت محفوظ یوده و کپی‌برداری از مطالب تنها با ذکر منبع و لینک به مطلب امکانپذیر است.Website Design: BetterStudio Custumized By Morteza Geransayeh


''';

  List<String> wordlist = text.split(' ');
  List badWordList = ['فالو', 'آنفالو', 'استوری'];
  List history = [];
  for (String element in wordlist) {
    if (badWordList.contains(element)) {
      history.add(element);
    }
  }

  if (history.isEmpty) {
    print('شما یک فرد بسیار پاک هستید');
  } else if (history.isNotEmpty) {
    print('شما دارای کلمه غیر مجاز هستید');
    print(history);
  }
}
